dryrun_task1_20260207/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.02415 -0.02415 -0.02)
    (0.02415 -0.02415 -0.02)
    (0.02415 0.02415 -0.02)
    (-0.02415 0.02415 -0.02)
    (-0.02415 -0.02415 0.0283)
    (0.02415 -0.02415 0.0283)
    (0.02415 0.02415 0.0283)
    (-0.02415 0.02415 0.0283)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (2 2 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    background
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
