dryrun_task1_20260207/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        internalMesh;

    solidBodyMotionFunction sixDoFMotion;

    CofG            (0 0 0);

    translation
    {
        type            table;
        file            "$FOAM_CASE/constant/6DoF.dat";
        columns         (0 1);
    }

    rotation
    {
        type            table;
        file            "$FOAM_CASE/constant/6DoF.dat";
        columns         (0 2);
    }
}


// ************************************************************************* //
