dryrun_task1_20260207/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probes
{
    type            probes;
    libs            ("libsampling.so");
    writeControl   timeStep;
    writeInterval  1;
    probeLocations
    (
        (0 9.95 19.77)
        (0 -9.95 19.77)
    );
    fixedLocations  false;
    fields
    (
        p
    );
}

// ************************************************************************* //
