dryrun_task1_20260207/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    allCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.02415 -0.02415 -0.02) (0.02415 0.02415 0.0283);
    }
    {
        name    internalMesh;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     allCells;
    }
);

// ************************************************************************* //
